import MainLayout from '../layouts/MainLayout.js';
import NextHead from 'next/head';
import './about.css';

export default class About extends React.Component {
    constructor(props, context) {
        super(props, context);
        this.state = {};
    }

    componentDidMount() {
        var WFw = $( ".wrap_wb_fixed" ).width();
        var Wdh = $( window ).height();
        $(document).on('scroll', function(){
            if ($('.wb_fixed')[0].offsetTop < $(document).scrollTop()){
                $(".wb_fixed").css({position: "fixed", top:90, width: WFw, 'max-height': Wdh - 100 });
            }
            if ($(document).scrollTop() < $(".wrap_wb_fixed")[0].offsetTop){
                $(".wb_fixed").css({position: "static", top: 0, 'max-height': 999});
            }
        });

        $('a[href^="#"]').on('click', function(e) {
            e.preventDefault();

            var target = this.hash;
            var $target = $(target);

            $('html, body').stop().animate({
                'scrollTop': $target.offset().top -90
            }, 900, 'swing', function() {
                //window.location.hash = target;
            });
            window.location.hash = target;
        });

        $(window).scroll(function() {
            var scroll = $(window).scrollTop();

            var sec2 = $('.history').offset().top - 90;
            var sec3 = $('.vision').offset().top - 90;
            var sec4 = $('.mission').offset().top - 90;
            var sec5 = $('.value').offset().top - 90;
            var sec6 = $('.policy').offset().top - 90;

            if (scroll >= sec6) {
                $('.link').removeClass('active');
                $('.link[href="#policy"]').addClass('active');
            } else if (scroll >= sec5) {
                $('.link').removeClass('active');
                $('.link[href="#value"]').addClass('active');
            } else if (scroll >= sec4) {
                $('.link').removeClass('active');
                $('.link[href="#mission"]').addClass('active');
            } else if (scroll >= sec3) {
                $('.link').removeClass('active');
                $('.link[href="#vision"]').addClass('active');
            } else if (scroll >= sec2) {
                $('.link').removeClass('active');
                $('.link[href="#history"]').addClass('active');
            } else {
                $('.link').removeClass('active');
            }
        });

        $("select").click(function() {
            var open = $(this).data("isopen");
            if(open) {
                window.location.href = $(this).val()
            }
            //set isopen to opposite so next time when use clicked select box
            //it wont trigger this event
            $(this).data("isopen", !open);
        });
    }

    render() {
        return (
            <MainLayout>
                <NextHead>
                </NextHead>

                <React.Fragment>
                    <div className="banner-vision-top"/>
                    <div className="bgnav-abt">
                        <div className="container d-none d-sm-block d-md-block d-lg-block d-xl-block">
                            <div className="row">
                                <div className="col">
                                    <ul className="aboutmenu">
                                        <li><a href="/about" className="active-menu">เกี่ยวกับองค์กร </a></li>
                                        <li><a href="/mission">ภารกิจ </a></li>
                                        <li><a href="/organization">โครงสร้างองค์กร </a></li>
                                        <li><a href="/personnel">ผู้บริหารและบุคลากร </a></li>
                                    </ul>
                                </div>
                            </div>
                        </div>
                        <div className="container  d-block d-sm-none d-md-none d-lg-none d-xl-none">
                            <div className="row">
                                <div className="col">
                                    <div className="menu-wrapper">
                                        <ul className="menu">
                                            <li className="menu-item active">
                                                <a href="/about">เกี่ยวกับองค์กร </a>
                                            </li>
                                            <li className="menu-item">
                                                <a href="/mission"> ภารกิจ </a>
                                            </li>
                                            <li className="menu-item">
                                                <a href="/organization"> โครงสร้างองค์กร </a>
                                            </li>
                                            <li className="menu-item">
                                                <a href="/personnel"> ผู้บริหารและบุคลากร </a>
                                            </li>
                                        </ul>
                                    </div>

                                </div>
                            </div>
                        </div>
                    </div>

                    <div className="container mt-5">
                        <div className="row">
                            <div className="col-md-5 col-lg-4 wrap_wb_fixed d-none d-sm-block d-md-block d-lg-block d-xl-block">
                                <div className="sidebar-menu wb_fixed" style={{overflow: 'hidden'}}>
                                    <ul>
                                        <li><a className="link" href="#history"><img src="/static/images/chat-icon.svg"/> ประวัติและความเป็นมา (History)</a></li>
                                        <li><a className="link" href="#vision"><img src="/static/images/chat-icon.svg"/> วิสัยทัศน์ (Vision)</a></li>
                                        <li><a className="link" href="#mission"><img src="/static/images/chat-icon.svg"/> พันธกิจ (Mission)</a></li>
                                        <li><a className="link" href="#value"><img src="/static/images/chat-icon.svg"/> ค่านิยมหลัก (Core Value)</a></li>
                                        <li><a className="link" href="#policy"><img src="/static/images/chat-icon.svg"/> นโยบาย แนวทาง และ การดำเนินงานของสถาบัน</a></li>
                                    </ul>
                                </div>
                            </div>
                            <div className="col-12 mb-3 d-block d-sm-none d-md-none d-lg-none d-xl-none">
                                <select id="selectbasic" name="selectbasic" className="form-control">
                                    <option value="#history">ประวัติและความเป็นมา (History)</option>
                                    <option value="#vision">วิสัยทัศน์ (Vision)</option>
                                    <option value="#mission">พันธกิจ (Mission)</option>
                                    <option value="#value">ค่านิยมหลัก (Core Value)</option>
                                    <option value="#policy">นโยบาย แนวทาง และ การดำเนินงานของสถาบัน</option>
                                </select>
                            </div>
                            <div className="col-md-7 col-lg-8">
                                <div className="vision-text">
                                    <section id="history" className="history">
                                        <h5>ประวัติและความเป็นมา (HISTORY)</h5>
                                        สถาบันเสริมศึกษาและทรัพยากรมนุษย์ เป็นสถาบันที่จัดตั้งขึ้นจากการควบรวมกันของสำนักเสริมศึกษาและบริการสังคม กับ สถาบันทรัพยากรมนุษย์
                                        ตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการจัดตั้งและแบ่งส่วนงานของมหาวิทยาลัยธรรมศาสตร์ พ.ศ.2559 เมื่อวันที่ 1 มิถุนายน 2560
                                        <br/><br/>
                                        โดยมีการแบ่งโครงสร้างการบริหารงานสำนักงานเลขานุการสถาบัน เป็น 4 งาน ได้แก่
                                        <br/><br/>
                                        1. งานวิจัยและวิชาการ <br/>
                                        2. งานพัฒนาคนและองค์กร <br/>
                                        3. งานบริหารสังคมและชุมชน <br/>
                                        4. งานบริหารสำนักงาน
                                        <br/><br/>
                                    </section>
                                    <section id="vision" className="vision">
                                        <h5>วิสัยทัศน์ (VISION) </h5>
                                        “สถาบันเสริมศึกษาและทรัพยากรมนุษย์เป็นสถาบันหลักของประเทศในการชี้นำและมีชื่อเสียงด้านทรัพยากรมนุษย์ในระดับชาติ”
                                        <br/><br/>
                                    </section>
                                    <section id="mission" className="mission">
                                        <h5>พันธกิจ (MISSION)</h5>
                                        สถาบันเสริมศึกษาและทรัพยากรมนุษย์มีภารกิจรับผิดชอบดำเนินการสร้าง พัฒนา และเผยแพร่องค์ความรู้ด้านทรัพยากรมนุษย์ผ่านงานวิจัยและวิชาการ
                                        จัดกิจกรรมบริการวิชาการสู่สังคมและชุมชนเพื่อสร้างโอกาสทางการศึกษาและการเรียนรู้ตลอดชีวิต บนรากฐานของสังคมแห่งการเรียนรู้
                                        ตลอดจนพัฒนาบุคลากรของมหาวิทยาลัยตามที่ได้รับมอบหมาย
                                        <br/><br/>
                                    </section>
                                    <section id="value" className="value">
                                        <h5>ค่านิยมหลัก (CORE VALUE)</h5>
                                        <b>SPECIAL</b>
                                        <br/>
                                        1. Service Mind มีใจบริการ หมายถึง การที่บุคลากรมีจิตใจรักในการบริการ มีความเต็มใจความกระตือรือร้น และมุ่งมั่น
                                        ที่จะให้บริการแก่ผู้รับบริการทุกระดับให้เกิดความพึงพอใจ
                                        <br/><br/>
                                        2. Professionalism เป็นผู้เชี่ยวชาญ มีความเป็นมืออาชีพ หมายถึง
                                        บุคลากรมีความรู้ความสามารถในงานที่ตนได้รับมอบหมายหรือที่รับผิดชอบอย่างถ่องแท้และสามารถบริหารจัดการให้งานดำเนินไปอย่างมี ประสิทธิภาพและประสิทธิผลสูงสุด
                                        <br/><br/>
                                        3. Enthusiasm มีความกระตือรือร้น หมายถึง การที่บุคลากรมีความกระตือรือร้น มีความใส่ใจในการทำงาน เพื่อให้บรรลุความสำเร็จ
                                        <br/><br/>
                                        4. Creativity มีความคิดสร้างสรรค์ หมายถึง การที่บุคลากรเป็นคนช่างคิด ช่างสังเกต และมีแนวคิดสิ่งใหม่ๆ
                                        เพื่อพัฒนาการทำงานไม่ยึดติดกับประสบการณ์หรือบริการที่ทำอยู่เดิม
                                        <br/><br/>
                                        5. IT Literacy รอบรู้ด้าน IT หมายถึง การที่บุคลากรมีทักษะ ในการใช้เทคโนโลยีที่เหมาะสมกับงานที่รับผิดชอบ
                                        และมีความสนใจต่อเทคโนโลยีที่เปลี่ยนไปอย่างสม่ำเสมอ
                                        <br/><br/>
                                        6. Accountability การรับผิด รับชอบ หมายถึง การที่บุคลากรของสถาบันมีความรับผิดชอบต่อตนเอง ต่อหน้าที่ๆได้รับมอบหมาย
                                        และมีความรับผิดชอบต่อสังคม
                                        <br/><br/>
                                        7. Loyalty ความซื่อสัตย์ ความภักดีต่อองค์กร หมายถึง บุคลากรมีความรักและภาคภูมิใจในความเป็นบุคลากรขององค์กร
                                        มีความจงรักภักดีต่อองค์กรทำงานด้วยความทุ่มเท เสียสละ เพื่อให้องค์กรมีความเจริญก้าวหน้า
                                        <br/><br/>
                                    </section>
                                    <section id="policy" className="policy">
                                        <h5>นโยบาย แนวทาง และ การดำเนินงานของสถาบัน</h5>
                                        <b>ประเด็นยุทธศาสตร์ที่ 1 </b>สร้างสรรค์งานวิจัยและนวัตกรรที่ก่อให้เกิดการเปลี่ยนแปลงในเชิงพัฒนาต่อสังคมไทยและสังคมโลก <br/>
                                        <b>เป้าประสงค์</b>

                                        1) ผลิตผลงานวิจัย และนวัตกรรมที่มีคุณภาพระดับมาตรฐานสากล และนำไปใช้ประโยชน์อย่างบูรณาการและยั่งยืน
                                        <br/>
                                        <b>นโยบาย/แนวทางการบริหารของหน่วยงาน</b>
                                        1. ส่งเสริมการทำงานวิจัยด้านทรัพยากรมนุษย์ที่มีคุณภาพสูง <br/>
                                        2. มุ่งเน้นงานวิจัยที่มีคุณภาพสามารถตีพิมพ์ในระดับประเทศและนานาชาติ <br/>
                                        3. ปรับปรุงกฎเกณฑ์การให้ทุนวิจัยที่ชัดเจนมุ่งเน้นผลกระทบที่จะเกิดขึ้น สามารถนำไปใช้ประโยชน์ได้จริงและคำนึงถึงคุณภาพของงานวิจัย
                                        เช่นงานวิจัยที่นำสังคมในด้านทรัพยากรมนุษย์, SDG กับการพัฒนาทรัพยากรมนุษย์, ประชาคมอาเซียนและการรวมกลุ่มอนุภูมิภาค, การพัฒนาประเทศไทยตามแนวทาง <br/> 4.0,
                                        การบริหารจัดการแรงงานข้ามชาติ,เขตเศรษฐกิจพิเศษรวมถึงงานวิจัยเชิงพื้นที่ เป็นต้น
                                        <br/>
                                        <b>ประเด็นยุทธศาสตร์ที่ 2 </b>สร้างเครือข่ายความร่วมมือทั้งภายในและภายนอกประเทศ <br/>
                                        <b>เป้าประสงค์</b>

                                        2) ผลักดันให้เกิดการสร้างความร่วมมือทางวิชาการ การสร้างงานวิจัยและนวัตกรรม ทั้งภายในและภายนอกประเทศ ทั้งระดับหน่วยงานและระดับบุคคล
                                        <br/><br/>
                                        <h5>นโยบาย/แนวทางการบริหารของหน่วยงาน</h5>

                                        1. การสร้างเครือข่ายเชิงยุทธศาสตร์ และ การแลกเปลี่ยนข้อมูล เป็นการดำเนินการเพื่อสร้างเครือข่ายในการทำงาน
                                        เนื่องจากงานด้านการฝึกอบรมเป็นงานด้านการบริการ ดังนั้นการมีหุ้นส่วนเชิงยุทธศาสตร์จะทำให้การทำงานมีความคล่องตัว เข้าถึงเป้าหมายได้ถูกกลุ่ม
                                        ลดระยะเวลาของการทำงานและต้นทุน
                                        <br/><br/>
                                        2.การผลักดันให้เกิดความร่วมมือกับบุคลากรของแต่ละคณะที่มีความรู้ความชำนาญในแต่ละสาขาแต่อาจไม่มีโอกาสในการถ่ายทอดความรู้ในลักษณะของการฝึกอบรม
                                        และพัฒนารูปแบบของ sharingประโยชน์ระหว่างผู้ริเริ่มโครงการกับสถาบันฯ เพื่อให้เกิดการจูงใจให้คณาจารย์ที่มีศักยภาพมาร่วมงานกับสถาบันฯ
                                        <br/><br/>
                                        3. การขยายเครือข่าย โดยเฉพาะการสร้างเครือข่ายความสัมพันธ์ระหว่างประเทศทั้งในด้านการวิจัยและการฝึกอบรม โดยการทำงานร่วมกับนักวิชาการต่างประเทศ
                                        หรือองค์กรระหว่างประเทศ เพื่อให้เกิดหลักสูตรที่ทันสมัย ตรงกับความต้องการของตลาดในอนาคต
                                        และอีกทางหนึ่งเป็นการยกระดับคะแนนการประเมินจัดอันดับให้กับทั้งสถาบันและมหาวิทยาลัย (เช่น QS ranking)
                                        <br/><br/>
                                        <b>ประเด็นยุทธศาสตร์ที่ 3</b> มุ่งเน้นคุณภาพการให้บริการวิชาการและบริการสุขภาพที่ได้มาตรฐานสากล <br/>
                                        <b>เป้าประสงค์</b>

                                        3) เพื่อให้บริการวิชาการที่หลากหลายด้วยคุณภาพแก่ชุมชนและสังคม
                                        4) เพื่อให้บริการที่เป็นเลิศด้านการรักษาพยาบาล การฟื้นฟู ป้องกัน และการสร้างเสริมสุขภาพแก่ประชาชน
                                        ด้วยคุณภาพตามมาตรฐานรางวัลคุณภาพแห่งชาติ (TQA)
                                        <br/><br/>
                                        <h5>นโยบาย/แนวทางการบริหารของหน่วยงาน</h5>

                                        1. การพัฒนาหลักสูตรการฝึกอบรมที่ทันสมัย โดยหลักสูตรต้องตอบสนองต่อการเปลี่ยนแปลงของโลกและภูมิภาค อนุภูมิภาค ยุทธศาสตร์ของประเทศ
                                        ภาคธุรกิจ หลักสูตรต้องมีการชี้นำสังคมและเป็นนวัตกรรมทางด้านการบริหารจัดการทรัพยากรมนุษย์
                                        โดยเป็นการจัดอบรมให้กับบุคลทั่วไปและเป็นการเฉพาะองค์กรรวมถึงการให้บริการด้านการให้คำปรึกษาในด้านการพัฒนาทรัพยากรมนุษย์
                                        <br/><br/>
                                        2. มีระบบการตั้งราคาหลักสูตรการฝึกอบรมที่เหมาะสม
                                        <br/><br/>
                                        3.ส่งเสริมงานด้านการบริการสังคมที่จะมีผลกระทบเชิงบวกที่สูงต่อสถาบันฯและมหาวิทยาลัยโดยมีการกำหนดในเชิงยุทธศาสตร์ว่าจะทำหรือไม่ทำงานบริการสังคมในลักษณะใด
                                        เพื่อให้เกิดการมุ่งเป้าที่ชัดเจน มีผลกระทบที่สูง และเป็นการใช้ทรัพยากรอย่างคุ้มค่า
                                        <br/><br/>
                                        4. ขยายฐานการฝึกอบรมกับประเทศเพื่อนบ้านในกลุ่มCLMV
                                        <br/>
                                        <b>ประเด็นยุทธศาสตร์ที่ 4</b> มุ่งสู่ความมั่นคง ยั่งยืน ด้วยการบริหารจัดการที่ทันสมัย <br/>
                                        <b>เป้าประสงค์</b>

                                        5) พัฒนาระบบงานและศักยภาพบุคลากรให้พร้อมรับต่อการเปลี่ยนแปลงอย่างยั่งยืน
                                        <br/><br/>
                                        <h5>นโยบาย/แนวทางการบริหารของหน่วยงาน</h5>

                                        1. ยึดหลักการบริหารที่ใช้หลักการบริหารจัดการที่ดี (good governance) ในการบริหารงานทั้งหลักนิติธรรม หลักคุณธรรม
                                        หลักความโปร่งใส หลักการมีส่วนร่วม หลักความรับผิดชอบและหลักความคุ้มค่า
                                        <br/><br/>
                                        2. การจัดทำยุทธศาสตร์และการจัดโครงสร้างองค์กรให้สอดรับภารกิจ
                                        โดยประเมินจากภารกิจตามพันธกิจและตามยุทธศาสตร์เดิมเป็นตัวตั้งและทบทวนยุทธศาสตร์ใหม่โดยการมีส่วนร่วมของผู้บริหารบุคลากรและผู้เกี่ยวข้อง
                                        (stakeholders) โดยมีประเด็นที่ท้าทายสอดรับกับภารกิจใหม่
                                        และสถานการณ์ใหม่ๆในด้านการฝึกอบรมและการพัฒนาทรัพยากรมนุษย์ของประเทศและภูมิภาค
                                        <br/><br/>
                                        3. การจัดโครงสร้างองค์กรและภาระงาน แผนพัฒนาบุคลากรโดยคำนึงถึงโครงสร้างที่เอื้อต่อการทำงาน
                                        มีภาระงานที่ไม่ทับซ้อนจนเกินไปมีการแบ่งภาระงานที่เหมาะสมตามความรู้ความสามารถ
                                        <br/><br/>
                                        4. การทำJob Description ตามตำแหน่งงานและใช้เป็นเครื่องมือในการทำแผนพัฒนาศักยภาพของบุคลากร
                                        <br/><br/>
                                        5. การสร้างทีม (Team Building) การจัดทำยุทธศาสตร์สถาบันฯโดยการมีส่วนร่วม
                                        เพื่อให้เกิดการทำงานเป็นทีม ตามภารกิจเดิมและ/หรือภารกิจที่มีการมอบหมายใหม่
                                        และให้เกิดความรู้สึกเป็นเจ้าของสถาบัน
                                        มีการสร้างวัฒนธรรมองค์กรที่พึงประสงค์และระบบการสื่อสารภายในองค์กรที่มีประสิทธิภาพโดยอาศัยเทคโนโลยีเป็นเครื่องมือช่วย
                                        <br/><br/>
                                        6. การปรับปรุง กฎเกณฑ์ เพื่อการกำกับ การส่งเสริม มากกว่าการจับผิดหรือการลงโทษ
                                        โดยเป็นการปรับปรุงกฎ ระเบียบที่เป็นอุปสรรคต่อการทำงาน
                                        เพื่อให้เกิดความคล่องตัวในการทำงานและเอื้ออำนวยต่อการทำงานเชิงรุก
                                        <br/><br/>
                                        7. การทำงานแบบมืออาชีพและการจัดการองค์ความรู้ภายในองค์กร
                                        เป็นการสร้างระบบและกิจกรรมเพื่อการแลกเปลี่ยนองค์ความรู้ในองค์กรเพื่อให้บุคลากรทราบถึงภารกิจหน้าที่ของบุคลากรในทีม
                                        มีการจัดทำคู่มือการทำงาน
                                        เพื่อให้องค์ความรู้อยู่กับองค์กรและบุคลากรผู้จัดทำสามารถนำไปใช้ในการประเมินผลการปฏิบัติงานประจำปี
                                        <br/><br/>
                                        8.
                                        มีการจัดระบบประเมินผลการปฏิบัติงานที่สะท้อนผลการทำงานของบุคลากรในแต่ละปีและมีความเป็นธรรม
                                        และมีระบบแรงจูงใจ(incentive) ที่สอดคล้องกับผลประกอบการของสถาบันและผลการปฏิบัติงาน
                                        <br/>
                                        9. มุ่งเน้นให้บุคลากรมีแนวคิดและการปฏิบัติงานของการให้บริการที่เป็นเลิศ
                                        <br/><br/>
                                        10.
                                        การส่งเสริมการพัฒนาความสามารถของบุคลากรของสถาบันฯให้มีความสามารถที่สูงขึ้น
                                        สามารถรองรับกับภารกิจใหม่ๆที่จะเกิดขึ้นในอนาคต โดยเป็นการพัฒนาตามสายงาน
                                        มีเป้าหมายของการพัฒนาบุคลากรทั้งในด้านการฝึกอบรม การศึกษาต่อ
                                        เพื่อรองรับกับภารกิจของสถาบันฯ เช่น การฝึกอบรม การให้ทุนการศึกษา
                                        <br/><br/>
                                        11. การวางแผนบริหารความเสี่ยง
                                        เพื่อเป็นการลดความเสี่ยงและความเสียหายกับองค์กรในกรณีที่เกิดเหตุการณ์ความเสี่ยง
                                        โดยเป็นการจัดทำแผนบริหารความเสี่ยงโดยการมีส่วนร่วมของบุคลากรของสถาบันฯ
                                        <br/><br/>
                                        12. การบริหารจัดการงบประมาณและการบริหารจัดการทรัพย์สินของสถาบันฯ
                                        ให้มีดอกผลที่งอกเงยเพื่อใช้สนับสนุนการทำงานของสถาบันฯโดยมีการตั้งคณะกรรมการเพื่อการมีส่วนร่วมในการบริหารจัดการสร้างระบบการบริหารจัดการงบประมาณให้มีประสิทธิภาพ
                                        มีความโปร่งใส
                                        รวมถึงการจัดหางบประมาณเงินทุนทั้งจากภายในและภายนอกเพื่อใช้ในการพัฒนางานวิจัยและการบริการสังคม
                                        <br/><br/>
                                        13. การใช้เทคโนโลยีเพื่อสนับสนุนการทำงานในด้านต่างๆ
                                        ทั้งยังเป็นการช่วยลดการใช้ทรัพยากรในการทำงาน
                                        <br/><br/>
                                        14. จัดพื้นที่ทำงานให้เหมาะสมกับการทำงาน
                                        <br/><br/>
                                        15. การประชาสัมพันธ์เชิงรุก และ การจัดทำ CSR
                                        อย่างเป็นระบบ เพื่อสื่อสารกับบุคลภายนอก
                                        ทั้งในด้านของการให้ข้อมูลต่อสังคมและเพื่อการสร้างภาพลักษณ์ที่ดีให้กับสถาบันฯและมหาวิทยาลัย
                                        <br/><br/>
                                        16. การดำเนินการตามกิจการพิเศษที่ได้รับมอบหมาย
                                        และการจัดหาวาระที่เหมาะสมในการจัดกิจกรรมที่จะเกิด
                                        impact ต่อสถาบันฯและมหาวิทยาลัย เช่น
                                        การจัดประเมินและการมอบรางวัลแก่หน่วยงานหรือองค์กรที่เกี่ยวข้องในการดำเนินงานด้านการพัฒนาทรัพยากรมนุษย์
                                        การจัดสัมมนาประจำปี(Symposium) การจัดสัมมนานานาชาติ
                                        (International Conference) เป็นต้น
                                    </section>
                                </div>
                            </div>
                        </div>
                    </div>
                </React.Fragment>

                <style jsx>{`
                `}</style>
            </MainLayout>
        );
    }
}